Revit 2016 API
FabricationConfiguration.GetMaterialName Method
 Gets material name from its identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2016
Syntax
C#
public string GetMaterialName(
	int matId
)
Visual Basic
Public Function GetMaterialName ( _
	matId As Integer _
) As String
Visual C++
public:
String^ GetMaterialName(
	int matId
)
Parameters
matId
Type: System.Int32
 The material identifier.
Return Value
 The group name.
See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace